### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:11",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:12" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:12/invocations" -> (known after apply)
        tags                           = {}
!       version                        = "12" -> (known after apply)
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "12" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7197775458204059798" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691631391768923000" -> "1691779596588509000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:11" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-10T01:38:01.022+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:11" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
!       s3_key                      = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
!       s3_object_version           = "8pkP.Qzt3n_DKOMlSCav7wo3tVsz0lwV" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "MoXz8MtxWliAZU9jEhP5cYQtcBCWMyE9f7vDvI0PZVo=" -> (known after apply)
!       source_code_size            = 24418271 -> (known after apply)
!       version                     = "11" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "eb65b4b9fe1ffc0e6eabfe46911474c4-5" -> (known after apply)
!       id                     = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> (known after apply)
!       key                    = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
-       tags                   = {} -> null
!       tags_all               = {} -> (known after apply)
!       version_id             = "8pkP.Qzt3n_DKOMlSCav7wo3tVsz0lwV" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/function",
+                       null,
                    ],
                ]
+               filename      = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
+               runtime       = "nodejs18.x"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1955309816462337381" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
!           "timestamp" = "1691631395421710000" -> "1691779600185827000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "6350065648788459910" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a859b53a44a5866eb020ccf5d4bb7f5cc96a8611d7c0f8dbcf466eff8396d48b.zip" -> "builds/c5427c8de8b6e505f3d9cc7ef009d9f39400bad8cd96945674d8b72673fd1171.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path             = "./dist/function/" -> "./dist/function"
                        # (1 unchanged attribute hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 6 to destroy.
```
</details>